In [1]:
import pandas as pd

In [2]:
chic=pd.read_csv('chicago-employees.csv').dropna(how="all")
chic['Department']=chic['Department'].astype('category') #converting deprtmentto category
chic.tail()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
32807,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$72,510.00",NaN
32808,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32809,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32810,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32811,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

In [3]:
chic.nunique() # unique values in each column

Name                 32520
Job Titles            1121
Department              36
Full or Part-Time        2
Salary or Hourly         2
Typical Hours            4
Annual Salary         1017
Hourly Rate            171
dtype: int64

In [4]:
chic['Department'].dtype #categorical dtype

CategoricalDtype(categories=['ADMIN HEARNG', 'ANIMAL CONTRL', 'AVIATION',
                  'BOARD OF ELECTION', 'BOARD OF ETHICS', 'BUDGET & MGMT',
                  'BUILDINGS', 'BUSINESS AFFAIRS', 'CITY CLERK',
                  'CITY COUNCIL', 'COMMUNITY DEVELOPMENT', 'COPA',
                  'CULTURAL AFFAIRS', 'DISABILITIES', 'DoIT',
                  'FAMILY & SUPPORT', 'FINANCE', 'FIRE', 'GENERAL SERVICES',
                  'HEALTH', 'HUMAN RELATIONS', 'HUMAN RESOURCES',
                  'INSPECTOR GEN', 'IPRA', 'LAW', 'LICENSE APPL COMM',
                  'MAYOR'S OFFICE', 'OEMC', 'POLICE', 'POLICE BOARD',
                  'PROCUREMENT', 'PUBLIC LIBRARY', 'STREETS & SAN',
                  'TRANSPORTN', 'TREASURER', 'WATER MGMNT'],
, ordered=False)

In [5]:
#"HELLO WORLD".lower() # convert to lower case\
"hello world".upper() # convert to upper case

'HELLO WORLD'

In [6]:
"hello world".title() # converts first letter to uppercaselen)

'Hello World'

In [7]:
len("hello world")

11

USING ABOVE FUNCTIONS TO A SERIES

In [8]:
chic['Name'].str.title() # so inorder to apply to a column use .str then use string functions.

0            Aaron,  Jeffery M
1              Aaron,  Karina
2          Aaron,  Kimberlei R
3          Abad Jr,  Vicente M
4           Abarca,  Emmanuel
                 ...
32807    Zylinska,  Katarzyna
32808       Zymantas,  Laura C
32809        Zymantas,  Mark E
32810      Zyrkowski,  Carlo E
32811     Zyskowski,  Dariusz
Name: Name, Length: 32812, dtype: object

In [9]:
chic['Name'].str.lower()

0            aaron,  jeffery m
1              aaron,  karina
2          aaron,  kimberlei r
3          abad jr,  vicente m
4           abarca,  emmanuel
                 ...
32807    zylinska,  katarzyna
32808       zymantas,  laura c
32809        zymantas,  mark e
32810      zyrkowski,  carlo e
32811     zyskowski,  dariusz
Name: Name, Length: 32812, dtype: object

In [10]:
chic['Name'].str.upper()

0            AARON,  JEFFERY M
1              AARON,  KARINA
2          AARON,  KIMBERLEI R
3          ABAD JR,  VICENTE M
4           ABARCA,  EMMANUEL
                 ...
32807    ZYLINSKA,  KATARZYNA
32808       ZYMANTAS,  LAURA C
32809        ZYMANTAS,  MARK E
32810      ZYRKOWSKI,  CARLO E
32811     ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32812, dtype: object

In [11]:
chic['Name'].str.lower().str.upper()

0            AARON,  JEFFERY M
1              AARON,  KARINA
2          AARON,  KIMBERLEI R
3          ABAD JR,  VICENTE M
4           ABARCA,  EMMANUEL
                 ...
32807    ZYLINSKA,  KATARZYNA
32808       ZYMANTAS,  LAURA C
32809        ZYMANTAS,  MARK E
32810      ZYRKOWSKI,  CARLO E
32811     ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32812, dtype: object

In [12]:
chic['Job Titles']=chic['Job Titles'].str.title()

In [13]:
len(chic['Name'])

32812

In [14]:
chic['Name'].str.len() # to find len of each string in a column
       #in python,len is a built in function but in pandas it is a method

0        17
1        15
2        19
3        19
4        18
         ..
32807    21
32808    18
32809    17
32810    19
32811    20
Name: Name, Length: 32812, dtype: int64

In [15]:
chic['Name'].str.capitalize() #just first character to uppercase and rest lowercase.

0            Aaron,  jeffery m
1              Aaron,  karina
2          Aaron,  kimberlei r
3          Abad jr,  vicente m
4           Abarca,  emmanuel
                 ...
32807    Zylinska,  katarzyna
32808       Zymantas,  laura c
32809        Zymantas,  mark e
32810      Zyrkowski,  carlo e
32811     Zyskowski,  dariusz
Name: Name, Length: 32812, dtype: object

In [16]:
chic['Name'].str.casefold() # returns a a string where all characters are in lower case

0            aaron,  jeffery m
1              aaron,  karina
2          aaron,  kimberlei r
3          abad jr,  vicente m
4           abarca,  emmanuel
                 ...
32807    zylinska,  katarzyna
32808       zymantas,  laura c
32809        zymantas,  mark e
32810      zyrkowski,  carlo e
32811     zyskowski,  dariusz
Name: Name, Length: 32812, dtype: object

In [17]:
 "Hello World".replace("l",'!')

'He!!o Wor!d'

In [18]:
chic['Department']=chic['Department'].str.replace('MGMNT','MANAGEMENT') # replace mgmnt with management

In [19]:
chic['Annual Salary']=chic['Annual Salary'].str.replace('$','').str.replace(',','').astype(float)
# changing string to float also removing , and $

<ipython-input-19-d3c84681d6a2>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chic['Annual Salary']=chic['Annual Salary'].str.replace('$','').str.replace(',','').astype(float)

In [20]:
chic['Annual Salary'].sum()

2178570595.68

In [21]:
chic['Annual Salary'].nlargest(5) # 5 largest salaries

8315     300000.0
13985    260004.0
8083     216210.0
26099    202728.0
9075     197736.0
Name: Annual Salary, dtype: float64

USING CONTAINS METHOD

In [22]:
mask=chic['Job Titles'].str.lower().str.contains('water') # to find labourer in the series

In [23]:
chic[mask]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
569,"ALUISE, VINCENT G",Foreman Of Water Pipe Construction,WATER MANAGEMENT,F,Hourly,40.0,NaN,$50.25
693,"ANDER, PERRY A",Water Chemist Ii,WATER MANAGEMENT,F,Salary,NaN,84516.0,NaN
707,"ANDERSON, ANDREW J",District Superintendent Of Water Distribution,WATER MANAGEMENT,F,Salary,NaN,111456.0,NaN
726,"ANDERSON, DONALD",Foreman Of Water Pipe Construction,WATER MANAGEMENT,F,Hourly,40.0,NaN,$50.25
737,"ANDERSON, HARVEY",Water Meter Machinist,WATER MANAGEMENT,F,Hourly,40.0,NaN,$40.70
...,...,...,...,...,...,...,...,...
30969,"WASHINGTON, JOSEPH",Water Chemist Iv,WATER MANAGEMENT,F,Salary,NaN,95580.0,NaN
31404,"WHITLOCK, JAMAAR",Water Meter Machinist - Trainee,WATER MANAGEMENT,F,Hourly,40.0,NaN,$24.42
31712,"WILLIAMS, MATTHEW",Foreman Of Water Pipe Construction,WATER MANAGEMENT,F,Hourly,40.0,NaN,$50.25
32131,"WOODRIDGE, ROBERT L",Foreman Of Water Pipe Construction,WATER MANAGEMENT,F,Hourly,40.0,NaN,$50.25
32297,"WTORKOWSKI, ALBERT P",Chief Water Engineer,WATER MANAGEMENT,F,Salary,NaN,125316.0,NaN

TO FIND WATER AT BEGINING

In [24]:
k=chic['Job Titles'].str.lower().str.startswith('water')
chic[k]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
693,"ANDER, PERRY A",Water Chemist Ii,WATER MANAGEMENT,F,Salary,NaN,84516.0,NaN
737,"ANDERSON, HARVEY",Water Meter Machinist,WATER MANAGEMENT,F,Hourly,40.0,NaN,$40.70
1092,"ASHLEY, KARMA T",Water Chemist Ii,WATER MANAGEMENT,F,Salary,NaN,84516.0,NaN
1226,"AZEEM, MOHAMMED A",Water Chemist Ii,WATER MANAGEMENT,F,Salary,NaN,59436.0,NaN
2457,"BOLTON, BRIAN E",Water Rate Taker,WATER MANAGEMENT,F,Salary,NaN,80532.0,NaN
...,...,...,...,...,...,...,...,...
29253,"TIGNOR, DARRYL B",Water Rate Taker,WATER MANAGEMENT,F,Salary,NaN,80532.0,NaN
29607,"TRAVIS COOK, LESLIE R",Water Rate Taker,WATER MANAGEMENT,F,Salary,NaN,80532.0,NaN
30298,"VELAZQUEZ, JOHN",Water Rate Taker,WATER MANAGEMENT,F,Salary,NaN,80532.0,NaN
30969,"WASHINGTON, JOSEPH",Water Chemist Iv,WATER MANAGEMENT,F,Salary,NaN,95580.0,NaN
31404,"WHITLOCK, JAMAAR",Water Meter Machinist - Trainee,WATER MANAGEMENT,F,Hourly,40.0,NaN,$24.42

In [25]:
chic[chic['Job Titles'].str.lower().str.endswith('st')]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
31,"ABOUELKHEIR, HASSAN A",Senior Programmer/Analyst,FAMILY & SUPPORT,F,Salary,NaN,110064.0,NaN
149,"ADAMS, RAYMOND B",Sr Procurement Specialist,PROCUREMENT,F,Salary,NaN,69924.0,NaN
220,"AGUILAR, JUANITA M",Editorial Asst,CITY CLERK,F,Salary,NaN,66948.0,NaN
249,"AGYEKUM, KOFI",Programmer/Analyst,BUSINESS AFFAIRS,F,Salary,NaN,92388.0,NaN
262,"AHMED, KHALID",Chief Programmer/Analyst,WATER MANAGEMENT,F,Salary,NaN,119124.0,NaN
...,...,...,...,...,...,...,...,...
32663,"ZEMKE, RICHARD P",Machinist,AVIATION,F,Hourly,40.0,NaN,$46.35
32680,"ZEROM, KRISTIANA M",Administrative Asst,MAYOR'S OFFICE,F,Salary,NaN,62976.0,NaN
32728,"ZIRNGIBL, DIANE M",Staff Asst,AVIATION,F,Salary,NaN,88344.0,NaN
32757,"ZOVKO, ERIKA",Administrative Asst,MAYOR'S OFFICE,F,Salary,NaN,64056.0,NaN
32811,"ZYSKOWSKI, DARIUSZ",Chief Data Base Analyst,DoIT,F,Salary,NaN,115932.0,NaN

lstrip,rstrip

In [26]:
'      Hello World'.lstrip() # strip empty spaces at left of string

'Hello World'

In [27]:
'Hello world     '.rstrip()# strip empty spaces at right of string

'Hello world'

In [28]:
'  Hello world   '.rstrip()

'  Hello world'

In [29]:
'   Hello world   '.strip() # strip spaces in between

'Hello world'

In [30]:
chic["Name"]=chic["Name"].str.lstrip().str.rstrip()

In [31]:
chic["Name"]

0           AARON,  JEFFERY M
1              AARON,  KARINA
2         AARON,  KIMBERLEI R
3         ABAD JR,  VICENTE M
4           ABARCA,  EMMANUEL
                 ...
32807    ZYLINSKA,  KATARZYNA
32808      ZYMANTAS,  LAURA C
32809       ZYMANTAS,  MARK E
32810     ZYRKOWSKI,  CARLO E
32811     ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32812, dtype: object

In [32]:
chic['Job Titles']=chic['Job Titles'].str.strip()

STRING METHODS ON INDEX

In [33]:
chic.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            32802, 32803, 32804, 32805, 32806, 32807, 32808, 32809, 32810,
            32811],
           dtype='int64', length=32812)

In [34]:
chic.set_index('Name',inplace=True)

In [35]:
chic.index=chic.index.str.strip().str.title()

In [36]:
chic.head(3)

,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
Name,,,,,,,
"Aaron, Jeffery M",Sergeant,POLICE,F,Salary,NaN,101442.0,NaN
"Aaron, Karina",Police Officer (Assigned As Detective),POLICE,F,Salary,NaN,94122.0,NaN
"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN

In [37]:
chic.columns=chic.columns.str.upper()

In [38]:
chic.head(3)

,JOB TITLES,DEPARTMENT,FULL OR PART-TIME,SALARY OR HOURLY,TYPICAL HOURS,ANNUAL SALARY,HOURLY RATE
Name,,,,,,,
"Aaron, Jeffery M",Sergeant,POLICE,F,Salary,NaN,101442.0,NaN
"Aaron, Karina",Police Officer (Assigned As Detective),POLICE,F,Salary,NaN,94122.0,NaN
"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN

SPLIT FUNCTION

In [44]:
"HELLO MY NAME IS SATHYA".split()

['HELLO', 'MY', 'NAME', 'IS', 'SATHYA']

In [45]:
"HELLO MY NAME IS SATHYA".split('NAME')

['HELLO MY ', ' IS SATHYA']

In [46]:
"HELLO MY NAME IS SATHYA".split(' ')

['HELLO', 'MY', 'NAME', 'IS', 'SATHYA']

In [53]:
chic=chic.reset_index()

In [58]:
chic['Name'].str.get(0)

0        A
1        A
2        A
3        A
4        A
        ..
32807    Z
32808    Z
32809    Z
32810    Z
32811    Z
Name: Name, Length: 32812, dtype: object

In [59]:
chic['Name'].str.get(3)# this gets what is in the position 3 in each row

0        o
1        o
2        o
3        d
4        r
        ..
32807    i
32808    a
32809    a
32810    k
32811    k
Name: Name, Length: 32812, dtype: object

In [61]:
chic['Name'].str.split(',').str.get(0)# tis gets what is in position 0 of the splitted name

0            Aaron
1            Aaron
2            Aaron
3          Abad Jr
4           Abarca
           ...
32807     Zylinska
32808     Zymantas
32809     Zymantas
32810    Zyrkowski
32811    Zyskowski
Name: Name, Length: 32812, dtype: object

In [62]:
chic['Name'].str.split(',').str.get(0).value_counts()

Williams    280
Johnson     255
Smith       248
Jones       194
Brown       189
           ...
Kalosky       1
Brant         1
Morgen        1
Morones       1
Maysonet      1
Name: Name, Length: 14132, dtype: int64

In [74]:
chic['JOB TITLES'].str.split(' ').str.get(0).value_counts()

Police             11316
Firefighter-Emt     1743
Sergeant            1164
Crossing             814
Motor                718
                   ...
Comm                   1
Corporation            1
Employability          1
Prepress               1
Chairperson            1
Name: JOB TITLES, Length: 328, dtype: int64

In [76]:
chic['Name'].str.split(',').str.get(1)

0            Jeffery M
1               Karina
2          Kimberlei R
3            Vicente M
4             Emmanuel
             ...
32807        Katarzyna
32808          Laura C
32809           Mark E
32810          Carlo E
32811          Dariusz
Name: Name, Length: 32812, dtype: object

In [80]:
 chic['Name'].str.split(',').str.get(1).str.strip().str.split(' ').str.get(0)
    # to get the first name.

0          Jeffery
1           Karina
2        Kimberlei
3          Vicente
4         Emmanuel
           ...
32807    Katarzyna
32808        Laura
32809         Mark
32810        Carlo
32811      Dariusz
Name: Name, Length: 32812, dtype: object

exploring expand and nparameter in split method

In [83]:
 chic['Name'].str.split(',',expand=True) #returns a dataframe rather than a 
                                          # series of python lists.

               0              1
0          Aaron      Jeffery M
1          Aaron         Karina
2          Aaron    Kimberlei R
3        Abad Jr      Vicente M
4         Abarca       Emmanuel
...          ...            ...
32807   Zylinska      Katarzyna
32808   Zymantas        Laura C
32809   Zymantas         Mark E
32810  Zyrkowski        Carlo E
32811  Zyskowski        Dariusz

[32812 rows x 2 columns]

In [87]:
chic[['Last Name','First Name']]= chic['Name'].str.split(',',expand=True) 
chic

,Name,JOB TITLES,DEPARTMENT,FULL OR PART-TIME,SALARY OR HOURLY,TYPICAL HOURS,ANNUAL SALARY,HOURLY RATE,Last Name,First Name
0,"Aaron, Jeffery M",Sergeant,POLICE,F,Salary,NaN,101442.0,NaN,Aaron,Jeffery M
1,"Aaron, Karina",Police Officer (Assigned As Detective),POLICE,F,Salary,NaN,94122.0,NaN,Aaron,Karina
2,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN,Aaron,Kimberlei R
3,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MANAGEMENT,F,Salary,NaN,110064.0,NaN,Abad Jr,Vicente M
4,"Abarca, Emmanuel",Concrete Laborer,TRANSPORTN,F,Hourly,40.0,NaN,$36.18,Abarca,Emmanuel
...,...,...,...,...,...,...,...,...,...,...
32807,"Zylinska, Katarzyna",Police Officer,POLICE,F,Salary,NaN,72510.0,NaN,Zylinska,Katarzyna
32808,"Zymantas, Laura C",Police Officer,POLICE,F,Salary,NaN,48078.0,NaN,Zymantas,Laura C
32809,"Zymantas, Mark E",Police Officer,POLICE,F,Salary,NaN,87006.0,NaN,Zymantas,Mark E
32810,"Zyrkowski, Carlo E",Police Officer,POLICE,F,Salary,NaN,93354.0,NaN,Zyrkowski,Carlo E
32811,"Zyskowski, Dariusz",Chief Data Base Analyst,DoIT,F,Salary,NaN,115932.0,NaN,Zyskowski,Dariusz

In [90]:
chic['JOB TITLES'].str.split(' ',expand=True)

,0,1,2,3,4,5,6,7,8
0,Sergeant,None,None,None,None,None,None,None,None
1,Police,Officer,(Assigned,As,Detective),None,None,None,None
2,Chief,Contract,Expediter,None,None,None,None,None,None
3,Civil,Engineer,Iv,None,None,None,None,None,None
4,Concrete,Laborer,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...
32807,Police,Officer,None,None,None,None,None,None,None
32808,Police,Officer,None,None,None,None,None,None,None
32809,Police,Officer,None,None,None,None,None,None,None
32810,Police,Officer,None,None,None,None,None,None,None
32811,Chief,Data,Base,Analyst,None,None,None,None,None

In [91]:
chic['JOB TITLES'].str.split(' ',expand=True,n=1) #n= no of split at first instance
                                                  # of space

              0                                1
0      Sergeant                             None
1        Police  Officer (Assigned As Detective)
2         Chief               Contract Expediter
3         Civil                      Engineer Iv
4      Concrete                          Laborer
...         ...                              ...
32807    Police                          Officer
32808    Police                          Officer
32809    Police                          Officer
32810    Police                          Officer
32811     Chief                Data Base Analyst

[32812 rows x 2 columns]

In [92]:
chic['JOB TITLES'].str.split(' ',expand=True,n=2)

              0         1                        2
0      Sergeant      None                     None
1        Police   Officer  (Assigned As Detective)
2         Chief  Contract                Expediter
3         Civil  Engineer                       Iv
4      Concrete   Laborer                     None
...         ...       ...                      ...
32807    Police   Officer                     None
32808    Police   Officer                     None
32809    Police   Officer                     None
32810    Police   Officer                     None
32811     Chief      Data             Base Analyst

[32812 rows x 3 columns]